# coding=utf-8


def add_supplier_zone():
    """ 供应商"""
    from supplychain.supplier.models import SupplierZone
    pianqu = ["织里片区", "山东片区", "温州片区", "佛山片区", "义乌金华片区", "广州深圳片区", "其他江浙沪", "其他片区",
              "杭州片区", "广州-沙河-大西豪", "广州-沙河-宝华", "广州-沙河-新金马",
              "广州-沙河-老金马", "广州-沙河-国大", "广州-沙河-女人街", "广州-沙河-鼎宝", "广州-沙河-国投", "广州-沙河-新塘",
              "广州-沙河- 大时代", "广州-沙河-富丽", "广州-沙河-非凡",
              "广州-沙河-佰润", "广州-沙河-三晟", "广州-沙河-机筑巷", "广州-沙河-新潮都", "广州-沙河-柏美", "广州-沙河-南城",
              "广州-沙河- 润景", "广州-沙河周边", "广州-广州火车站-白马",
              "广州-广州火车站-红棉", "广州-广州火车站-汇美", "广州-广州火车站-站西", "广州-广州火车站-一马", "广州-广州火车站-地一大道",
              "广州-广州火车站-新天地", "广州-十三行-红遍天",
              "广州-十三行-新中国", "广州-十三行-大时代", "广州-十三行-国际时装城", "广州-十三行-新中天", "广州-十三行-十三行网批",
              "广州-十三行-美衣城", "广州-石井-广大", "广州-石井-锦东",
              "广州-石井-庆丰", "广州-石井-金马", "广州-石井-银马", "广州其他片区", "杭州片区", "深圳片区", "义乌金华片区",
              "其他江浙沪片 区", "其他片区"]
    for i in pianqu:
        try:
            sz = SupplierZone()
            sz.name = i
            sz.save()
        except:
            pass

