# encoding=utf8
from django.core.management import BaseCommand

from flashsale.xiaolumm.models import AccountSubject


class Command(BaseCommand):


    def handle(self, *args, **options):
        SUBJECTS = [
            ('1101', '货币资金-现金', '0'),
            ('1102', '货币资金-银行存款', '0'),
            ('1103', '货币资金-平台', '0'),
            ('110301', '货币资金-平台-微信', '1103'),
            ('110302', '货币资金-平台-支付宝', '1103'),
            ('1104', '应收账款', '0'),
            ('110401', '应收账款-钱包抵让', '1104'),
            ('1201', '应付账款', '0'),
            ('120101', '应付账款-小鹿钱包', '1201'),
            ('120102', '应付账款-妈妈钱包', '1201'),
            ('12010201', '应付账款-妈妈钱包-待确定', '120102'),
            ('12010202', '应付账款-妈妈钱包-已确定', '120102'),
            ('120103', '应付账款-待提现', '1201'),
            ('12010301', '应付账款-待提现-待审核', '120103'),
            ('12010302', '应付账款-待提现-已审核', '120103'),
            ('1401', '主营业务收入', '0'),
            ('140101', '主营业务收入-退款', '1401'),
            ('1601', '销售费用', '0'),
            ('160101', '销售费用-红包', '1601'),
            ('160102', '销售费用-妈妈返利', '1601'),
        ]
        for code, name, parent_code in SUBJECTS:
            subject = AccountSubject(code=code, name=name, parent=parent_code)
            subject.save()
            print subject

